In [ ]:
! pip install sqlalchemy pandas
%pip install psycopg2-binary
! pip install openpyxl psycopg2-binary python-dotenv

In [4]:
import pandas as pd
from sqlalchemy import create_engine
from dotenv import load_dotenv
import os

In [ ]:
retail_df = pd.read_excel('retail.xlsx')
retail_df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [7]:
load_dotenv()
database_url = os.getenv('DATABASE_URL')

In [ ]:
engine = create_engine(database_url)

retail_df.to_sql('retail_data', engine, if_exists='replace', index=False)

In [11]:
from dotenv import load_dotenv
import os

load_dotenv()

print("DATABASE_URL =", os.getenv("DATABASE_URL"))

DATABASE_URL = postgresql+psycopg2://postgres:12345@localhost:5432/retail_db

In [17]:
retail_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 536641 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    536641 non-null  object
 1   StockCode    536641 non-null  object
 2   Description  536641 non-null  object
 3   Quantity     536641 non-null  int64
 4   InvoiceDate  536641 non-null  datetime64[ns]
 5   UnitPrice    536641 non-null  float64
 6   CustomerID   536641 non-null  float64
 7   Country      536641 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 36.8+ MB

1. Quantity Validation
Any quantity below 1 is invalid (returns, errors).
Exclude or filter out all transactions with negative or zero quantity.

In [18]:
retail_df['invalid'] = retail_df['Quantity'] < 1 
retail_df = retail_df[retail_df['Quantity'] >= 1]
print(retail_df['Quantity'].min())

1

In [19]:
retail_df = retail_df[retail_df['Quantity'] >= 1]
print(retail_df['Quantity'].min())

1

2. Unit Price Validation
(a). Unit prices cannot be negative.
(b). Remove or correct all rows with UnitPrice < 0.

In [ ]:
# Unit price validation

retail_df = retail_df[retail_df['UnitPrice'] >= 0]
print(retail_df['UnitPrice'].min())

0.0

3. Additional Cleaning
(a). Remove invoice cancellations (InvoiceNo beginning with "C").
(b).Drop rows where CustomerID is missing.
(c).Remove duplicate records.
(d).Create new fields:
(e).Revenue = Quantity × UnitPrice
(f).Month, Year, Day extracted from InvoiceDate

In [ ]:
# Remove invoice cancellations (InvoiceNo beginning with "C").
retail_df = retail_df[~retail_df['InvoiceNo'].str.startswith('C', na=False )]
print(retail_df['InvoiceNo'].str.startswith('C').sum())

In [22]:
# Drop rows where CustomerID is missing.
retail_df['CustomerID'] = retail_df['CustomerID'].dropna()
print(retail_df['CustomerID'].isna().sum())

0

In [23]:
# Remove duplicate records.
retail_df = retail_df.drop_duplicates()
print(retail_df.duplicated().sum())

0

In [ ]:
# Create new fields:
# Revenue = Quantity × UnitPrice
# Month, Year, Day extracted from InvoiceDate

retail_df['Revenue'] = retail_df['Quantity'] * retail_df['UnitPrice']
# month
retail_df['Month'] = retail_df['InvoiceDate'].dt.month

# year
retail_df['Year'] = retail_df['InvoiceDate'].dt.year

# day
retail_df['Day'] = retail_df['InvoiceDate'].dt.day

retail_df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,invalid,Revenue,Month,Year,Day
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,False,15.30,12,2010,1
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,False,20.34,12,2010,1
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,False,22.00,12,2010,1
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,False,20.34,12,2010,1
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,False,20.34,12,2010,1

4. Store a "cleaned" version
Load the cleaned dataset into a new SQL table, e.g., online_retail_clean.

In [25]:
load_dotenv()
clean_retail = os.getenv('CLEAN_RETAIL')

In [26]:
engine = create_engine(clean_retail)
retail_df.to_sql('clean_retail_data', engine, if_exists='append', index=False)
print("Cleaned data uploaded successfully.")

Cleaned data uploaded successfully.

PHASE 4 — DATA ANALYSIS (IN PYTHON ONLY)
Perform analytical steps to prepare insights for leadership:

1. Time Series (2011 Revenue by Month)

In [27]:
# Filter data for Year = 2011
retail_df = retail_df[retail_df['Year'] == 2011]
retail_df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,invalid,Revenue,Month,Year,Day
42481,539993,22386,JUMBO BAG PINK POLKADOT,10,2011-01-04 10:00:00,1.95,13313.0,United Kingdom,False,19.5,1,2011,4
42482,539993,21499,BLUE POLKADOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom,False,10.5,1,2011,4
42483,539993,21498,RED RETROSPOT WRAP,25,2011-01-04 10:00:00,0.42,13313.0,United Kingdom,False,10.5,1,2011,4
42484,539993,22379,RECYCLING BAG RETROSPOT,5,2011-01-04 10:00:00,2.10,13313.0,United Kingdom,False,10.5,1,2011,4
42485,539993,20718,RED RETROSPOT SHOPPER BAG,10,2011-01-04 10:00:00,1.25,13313.0,United Kingdom,False,12.5,1,2011,4

In [28]:
Total_revenues = (retail_df.groupby('Month')['Revenue'].sum().reset_index().sort_values(by='Month'))
Total_revenues

    Month      Revenue
0       1   689811.610
1       2   522545.560
2       3   716215.260
3       4   536968.491
4       5   769296.610
5       6   760547.010
6       7   718076.121
7       8   757841.380
8       9  1056435.192
9      10  1151263.730
10     11  1503866.780
11     12   637790.330

In [29]:
#Identify seasonal patterns or month-to-month changes
retail_df['Revenue'] = retail_df['Quantity'] * retail_df['UnitPrice']
montly_revenue = retail_df.groupby('Month')['Revenue'].sum().reset_index()
montly_revenue

    Month      Revenue
0       1   689811.610
1       2   522545.560
2       3   716215.260
3       4   536968.491
4       5   769296.610
5       6   760547.010
6       7   718076.121
7       8   757841.380
8       9  1056435.192
9      10  1151263.730
10     11  1503866.780
11     12   637790.330

2. Country Performance (Excluding United Kingdom)
Rank countries by total revenue
Identify the top 10 revenue-generating countries
Compute both revenue and quantity sold

In [30]:
# Country Performance (Excluding United Kingdom)
# Rank countries by total revenue
country_rank = (retail_df[retail_df['Country'] != 'United Kingdom'].groupby('Country')['Revenue'].sum().reset_index()
.sort_values(by='Revenue', ascending=False))

country_rank.head()

        Country    Revenue
23  Netherlands  276661.86
10         EIRE  273107.26
14      Germany  213472.66
13       France  200009.06
0     Australia  137488.46

In [31]:
# Identify the top 10 revenue-generating countries
top_10_countries = country_rank.head(10)
top_10_countries

        Country    Revenue
23  Netherlands  276661.86
10         EIRE  273107.26
14      Germany  213472.66
13       France  200009.06
0     Australia  137488.46
30        Spain   59714.83
32  Switzerland   55762.68
3       Belgium   39386.43
31       Sweden   34533.53
24       Norway   32378.32

3. Top Customers by Revenue
Rank all customers by total revenue
Identify the top 10 highest-spending customers

In [32]:
# Compute both revenue and quantity sold for these countries
top_countries = top_10_countries['Country'].tolist()
country_performance = (retail_df[retail_df['Country'].isin(top_countries)].groupby('Country')
.agg({'Revenue': 'sum', 'Quantity': 'sum'}).reset_index())

country_performance

       Country    Revenue  Quantity
0    Australia  137488.46     83742
1      Belgium   39386.43     21482
2         EIRE  273107.26    141501
3       France  200009.06    107072
4      Germany  213472.66    112290
5  Netherlands  276661.86    194126
6       Norway   32378.32     15756
7        Spain   59714.83     27077
8       Sweden   34533.53     32124
9  Switzerland   55762.68     29904

In [33]:
# Top Customers by Revenue
# Rank all customers by total revenue
customer_rank = (retail_df.groupby('CustomerID')['Revenue'].sum().reset_index().sort_values(by='Revenue', ascending=False))
customer_rank

      CustomerID     Revenue
0            0.0  1503871.91
1655     14646.0   271614.14
4088     18102.0   231822.69
3638     17450.0   192361.95
2938     16446.0   168472.50
...          ...         ...
3460     17194.0       10.00
2944     16454.0        6.90
1758     14792.0        6.20
3138     16738.0        3.75
670      13256.0        0.00

[4221 rows x 2 columns]

In [34]:
# dentify the top 10 highest-spending customers
top_10_customers = customer_rank.head(10)
top_10_customers

      CustomerID     Revenue
0            0.0  1503871.91
1655     14646.0   271614.14
4088     18102.0   231822.69
3638     17450.0   192361.95
2938     16446.0   168472.50
1842     14911.0   135973.23
56       12415.0   124914.53
1306     14156.0   116887.88
3679     17511.0    84351.30
1        12346.0    77183.60

4. Global Product Demand
Compute total quantity sold per country
Remove the United Kingdom
Rank countries by demand and highlight high-opportunity markets

In [35]:
# Compute total quantity sold per country
top_customers = top_10_customers['CustomerID'].tolist()
customer_performance = (retail_df[retail_df['CustomerID'].isin(top_customers)].groupby('CustomerID')
.agg({'Revenue': 'sum', 'Quantity': 'sum'}).reset_index())
customer_performance

   CustomerID     Revenue  Quantity
0         0.0  1503871.91    429100
1     12346.0    77183.60     74215
2     12415.0   124914.53     77670
3     14156.0   116887.88     56220
4     14646.0   271614.14    190777
5     14911.0   135973.23     77159
6     16446.0   168472.50     80997
7     17450.0   192361.95     69187
8     17511.0    84351.30     58123
9     18102.0   231822.69     57429

In [42]:
# Remove the United Kingdom from the dataset
retail_df = retail_df[retail_df['Country'] != 'United Kingdom']
retail_df['Country']

43419     Sweden
43420     Sweden
43421     Sweden
43422     Sweden
43423     Sweden
           ...
541904    France
541905    France
541906    France
541907    France
541908    France
Name: Country, Length: 42656, dtype: object

In [ ]:
# Rank countries by demand and highlight high-opportunity markets

country_rank = (retail_df.groupby('Country')['Quantity'].sum().reset_index().sort_values(by='Quantity', ascending=False))
country_rank.head()

        Country  Quantity
23  Netherlands    194126
10         EIRE    141501
14      Germany    112290
13       France    107072
0     Australia     83742